import React from 'react';

class Article extends React.Component{

    constructor(){
        super();
        // this.state = {title: ''};
    }

    render(){
        return (
            <div className="Article">
                <h2>{this.props.params.title}</h2>
                <p>
                    2Идейные соображения высшего порядка, а также дальнейшее развитие различных форм деятельности позволяет
                    выполнять важные задания по разработке направлений прогрессивного развития. Равным образом начало
                    повседневной работы по формированию позиции играет важную роль в формировании модели развития.
                    Равным образом сложившаяся структура организации позволяет оценить значение существенных финансовых
                    и административных условий. Повседневная практика показывает, что начало повседневной работы по
                    формированию позиции в значительной степени обуславливает создание позиций, занимаемых участниками
                    в отношении поставленных задач. Идейные соображения высшего порядка, а также консультация с широким
                    активом представляет собой интересный эксперимент проверки новых предложений. Товарищи! начало
                    повседневной работы по формированию позиции играет важную роль в формировании систем массового
                    участия.
                </p>

                <p>
                    Повседневная практика показывает, что постоянный количественный рост и сфера нашей активности в
                    значительной степени обуславливает создание систем массового участия. Идейные соображения высшего
                    порядка, а также консультация с широким активом требуют определения и уточнения существенных финансовых
                    и административных условий. С другой стороны начало повседневной работы по формированию позиции влечет
                    за собой процесс внедрения и модернизации систем массового участия. С другой стороны постоянный
                    количественный рост и сфера нашей активности способствует подготовки и реализации дальнейших направлений
                    развития. Не следует, однако забывать, что постоянный количественный рост и сфера нашей активности в
                    значительной степени обуславливает создание модели развития.
                </p>

                <p>
                    Задача организации, в особенности же дальнейшее развитие различных форм деятельности требуют определения
                    и уточнения модели развития. Идейные соображения высшего порядка, а также дальнейшее развитие различных
                    форм деятельности позволяет оценить значение соответствующий условий активизации. Таким образом
                    постоянное информационно-пропагандистское обеспечение нашей деятельности в значительной степени
                    обуславливает создание существенных финансовых и административных условий. Разнообразный и богатый
                    опыт начало повседневной работы по формированию позиции в значительной степени обуславливает создание
                    форм развития.
                </p>

                <p>
                    Разнообразный и богатый опыт постоянное информационно-пропагандистское обеспечение нашей деятельности
                    позволяет оценить значение системы обучения кадров, соответствует насущным потребностям. Значимость
                    этих проблем настолько очевидна, что начало повседневной работы по формированию позиции требуют от нас
                    анализа соответствующий условий активизации. Таким образом консультация с широким активом требуют
                    определения и уточнения систем массового участия. Идейные соображения высшего порядка, а также
                    постоянное информационно-пропагандистское обеспечение нашей деятельности требуют от нас анализа
                    существенных финансовых и административных условий. С другой стороны дальнейшее развитие различных
                    форм деятельности играет важную роль в формировании направлений прогрессивного развития. Товарищи!
                    новая модель организационной деятельности требуют от нас анализа дальнейших направлений развития.
                </p>
            </div>
        );
    }
}

export default Article